Revit 2027 API
UnitTypeId.UsSurveyFeet Property
 US survey feet.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId UsSurveyFeet { get; }
Public Shared ReadOnly Property UsSurveyFeet As ForgeTypeId
	Get
public:
static property ForgeTypeId^ UsSurveyFeet {
	ForgeTypeId^ get ();
}
static member UsSurveyFeet : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
UnitTypeId Class
Autodesk.Revit.DB Namespace